webapp/jsp/resource/soapTest.xml

<?xml version="1.0" encoding='UTF-8'?>
<env:Envelope
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">

    <env:Header/>
    <env:Body>
        <User:getUser xmlns:User="localhost:8080/UserSoap">
            <User:id>5</User:id>
        </User:getUser>
    </env:Body>

</env:Envelope>